src/DataProcessors/ПерспективныеПланы/ПерспективныеПланы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПерспективныеПланы</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСпецификаций</types>
      <types>EnumRef.СтатусыМПЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/ПерспективныеПланы/ПерспективныеПланы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПерспективныеПланы</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезПриб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезКм</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыМПЗ/СтатусыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыМПЗ</name>
  <enumValues>
    <name>Основная</name>
  </enumValues>
  <enumValues>
    <name>ОНР</name>
  </enumValues>
  <enumValues>
    <name>ДоИсчерпанияЗапасов</name>
  </enumValues>
  <enumValues>
    <name>Аналог</name>
  </enumValues>
  <enumValues>
    <name>Неликвид</name>
  </enumValues>
  <enumValues>
    <name>ПроблеммыЛогистики</name>
  </enumValues>
  <enumValues>
    <name>Запрещённая</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Материалы/Материалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Материалы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PartNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатериала</name>
    <type>
      <types>CatalogRef.ВидыМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Возвратный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВариабельности</name>
    <type>
      <types>EnumRef.ГруппыВариабельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоЗакупкам</name>
    <type>
      <types>EnumRef.ГруппыПоЗакупкам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИВХ</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаХранения</name>
    <type>
      <types>EnumRef.ЗоныХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторВнесения</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталогизатор</name>
    <type>
      <types>CatalogRef.Каталогизатор</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКЗаказу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьГрупповойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьЗаготовки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьИндивидуальнойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Критичный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоЗакупкам</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МинОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеSMD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативРабочейЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМодели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПиковыеПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <comment>Полное наименование, краткие характеристики</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакНеделимойУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВнесения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрослеживаемыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделПоЕСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНормированияЗакупок</name>
    <type>
      <types>EnumRef.ТипыНормированияЗакупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоставки</name>
    <type>
      <types>EnumRef.ТипыПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРиска</name>
    <type>
      <types>EnumRef.ТипыРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходнойКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаФактическаяНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтационарныеПитатели</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Замены</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщики</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КоммерческиеПредложения</name>
    <attributes>
      <name>КП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБыло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСтало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ПерспективныеПланы/Forms/ФормаЗагрузки1/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Элементы.Проект.Видимость = ЭтаФорма.Параметры.Проектный;
Параметры.ТипСправочника = ЭтаФорма.Параметры.ТипСправочника;
Параметры.СписокПочтовойРассылки.ЗагрузитьЗначения(ЭтаФорма.Параметры.СписокРассылки);
НаДату = НачалоМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
НаДату = НачалоМесяца(НаДату);
КонецПроцедуры
          
&НаСервере
Процедура СоздатьТабличныйДокумент(ТабДок,ТабДокОшибок)
ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("ИзменениеПерспективногоПлана"); 
ОблШапка = Макет.ПолучитьОбласть("Шапка|Наименование");
ОблШапкаПериод = Макет.ПолучитьОбласть("Шапка|Период");	
 
ОблШапка.Параметры.ДатаНач = Формат(НаДату,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(ДобавитьМесяц(НаДату,КоличествоМесяцев-1),"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаВывода = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);                              

Макет = ОбъектЗн.ПолучитьМакет("ФайлОшибок");
ОблШапкаОшибок = Макет.ПолучитьОбласть("Шапка|Общая");
ОблПериодОшибок = Макет.ПолучитьОбласть("Шапка|Период");

ТабДокОшибок.Вывести(ОблШапкаОшибок);

ТекДата = НачалоМесяца(НаДату);
	Для к = 1 по КоличествоМесяцев Цикл
	ОблШапкаПериод.Параметры.ММГГ = Формат(ТекДата,"ДФ=MM.yy"); 
	ТабДок.Присоединить(ОблШапкаПериод);
	ОблПериодОшибок.Параметры.ПП = Формат(ТекДата,"ДФ=MM.yy");			
	ТабДокОшибок.Присоединить(ОблПериодОшибок);	
	ТекДата = ДобавитьМесяц(ТекДата,1);
	КонецЦикла;
КонецПроцедуры  

&НаСервере
Функция ПолучитьEmailСотрудника()
Возврат(ПараметрыСеанса.Пользователь.Email);
КонецФункции

&НаСервере
Функция ПолучитьEmailПолучателя(Сотрудник)
Возврат(Сотрудник.Email);
КонецФункции

&НаКлиенте
Процедура ПочтоваяРассылка(ТабДок,ТабДокОшибок,ЕстьОшибки)
	Если Параметры.СписокПочтовойРассылки.Количество() = 0 Тогда
	Сообщить("Нет списка почтовой рассылки!");
	Возврат;
	КонецЕсли;
EmailСотрудника = ПолучитьEmailСотрудника();
Сообщение = Новый ИнтернетПочтовоеСообщение;
ИПП = Новый ИнтернетПочтовыйПрофиль; 

НастройкиПочты = ОбщийМодульВызовСервера.ПолучитьНастройкиПочты();
ИПП.АдресСервераSMTP = НастройкиПочты.АдресСервераSMTP; 
ИПП.ПортSMTP = НастройкиПочты.ПортSMTP;
ИПП.ВремяОжидания = 60; 
ИПП.Пароль = НастройкиПочты.ПарольПочтовогоСервера; 
ИПП.Пользователь = EmailСотрудника; 
	Для каждого Стр Из Параметры.СписокПочтовойРассылки Цикл
    Сообщение.Получатели.Добавить(ПолучитьEmailПолучателя(Стр.Значение));
	КонецЦикла; 
Сообщение.Отправитель.Адрес = EmailСотрудника;
Сообщение.Тема = "Загружен перспективный план с "+Формат(НаДату,"ДФ=dd.MM.yyyy")+" по "+Формат(ДобавитьМесяц(НаДату,КоличествоМесяцев-1),"ДФ=dd.MM.yyyy"); 
Текст = "Здравствуйте!";
Текст = Текст + Символы.ПС+ "";
Текст = Текст + Символы.ПС+ "Загружен перспективный план с "+Формат(НаДату,"ДФ=dd.MM.yyyy")+" по "+Формат(ДобавитьМесяц(НаДату,КоличествоМесяцев-1),"ДФ=dd.MM.yyyy");	
ИмяФайла = ПолучитьИмяВременногоФайла("xls");
ТабДок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLS);
Сообщение.Вложения.Добавить(ИмяФайла,"Перспективный план за период");	
	Если ЕстьОшибки Тогда
	ИмяФайла = ПолучитьИмяВременногоФайла("xls");
	ТабДокОшибок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLS);
	Сообщение.Вложения.Добавить(ИмяФайла,"Ошибки загрузки");
	Текст = Текст + Символы.ПС+ "";
	Текст = Текст + Символы.ПС+ "Есть ошибки загрузки (см. второй приложенный файл).";
	КонецЕсли;
Текст = Текст + Символы.ПС+ "";
Текст = Текст + Символы.ПС+ "С уважением, email: "+EmailСотрудника;
Сообщение.Тексты.Добавить(Текст);
// Подключиться и отправить. 
Почта = Новый ИнтернетПочта; 
Почта.Подключиться(ИПП);
Почта.Послать(Сообщение); 
Почта.Отключиться();
ПоказатьОповещениеПользователя("Сообщение отправлено!");	
КонецПроцедуры
            
&НаСервере
Функция ЗагрузитьНаСервере(ТабДок,ТабДокОшибок)
ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("ИзменениеПерспективногоПлана"); 
ОблСтрока = Макет.ПолучитьОбласть("Строка|Наименование");
ОблСтрокаПериод = Макет.ПолучитьОбласть("Строка|Период");

Макет = ОбъектЗн.ПолучитьМакет("ФайлОшибок");
ОблСтрокаОшибок = Макет.ПолучитьОбласть("Строка|Общая");
ОблПериодОшибок = Макет.ПолучитьОбласть("Строка|Период");
флОшибки = Ложь;                
	Для каждого ТЧ Из ТаблицаПП Цикл
		Если ЗначениеЗаполнено(ТЧ.Номенклатура) Тогда
		ТекДата = НаДату;
		ОблСтрока.Параметры.Статус = ТЧ.Статус;
		ОблСтрока.Параметры.Наименование = СокрЛП(ТЧ.Наименование);
		ТабДок.Вывести(ОблСтрока);
			Для каждого Стр Из ТЧ.СписокМесяцев Цикл
			РегПП = РегистрыСведений.ПерспективныеПланы.Получить(ТекДата,Новый Структура("МПЗ,Проект",ТЧ.Номенклатура,Проект));
			РегППНовый = РегистрыСведений.ПерспективныеПланы.СоздатьМенеджерЗаписи();
			РегППНовый.Период = ТекДата;
			РегППНовый.МПЗ = ТЧ.Номенклатура;
			РегППНовый.Проект = Проект; 
			РегППНовый.Количество = Стр.Значение;
			РегППНовый.Записать(Истина);
			ОблСтрокаПериод.Параметры.КолППСтарое = РегПП.Количество;
			ОблСтрокаПериод.Параметры.КолППНовое = Стр.Значение;
			ТабДок.Присоединить(ОблСтрокаПериод);
			ТекДата = ДобавитьМесяц(ТекДата,1);
			КонецЦикла;	
		Иначе
		ОблСтрокаОшибок.Параметры.Наименование = СокрЛП(ТЧ.Наименование);
		ТабДокОшибок.Вывести(ОблСтрокаОшибок);
			Для каждого Стр Из ТЧ.СписокМесяцев Цикл
			ОблПериодОшибок.Параметры.ПП = Стр.Значение;
			ТабДокОшибок.Присоединить(ОблПериодОшибок);
			ТекДата = ДобавитьМесяц(ТекДата,1);
			КонецЦикла; 
		флОшибки = Истина;
		КонецЕсли;	
	КонецЦикла; 
Возврат(флОшибки);
КонецФункции

&НаКлиенте
Процедура КнопкаОК(Команда)
	Если Элементы.Проект.Видимость Тогда
		Если Не ЗначениеЗаполнено(Проект) Тогда
		Сообщить("Выберите проект разработки!");
		Возврат;
		КонецЕсли;	
	КонецЕсли;
		Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		ТабДок = Новый ТабличныйДокумент;
		ТабДокОшибок = Новый ТабличныйДокумент;

		СоздатьТабличныйДокумент(ТабДок,ТабДокОшибок);
		Результат = ЗагрузитьНаСервере(ТабДок,ТабДокОшибок);
		ТабДок.Показать("Изменение помесячных перспективных планов");
			Если Результат Тогда
			ТабДокОшибок.Показать("Ошибки загрузки");
			КонецЕсли;
		ПочтоваяРассылка(ТабДок,ТабДокОшибок,Результат);
		ЭтаФорма.Закрыть(Истина);
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры
                  
&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(Наименование,СписокМесяцев)
ТЧ = ТаблицаПП.Добавить();
ТЧ.Наименование = Наименование;     
	Для каждого Кол Из СписокМесяцев Цикл
	ТЧ.СписокМесяцев.Добавить(Кол.Значение);
	КонецЦикла;
		Если Параметры.ТипСправочника = 1 Тогда
		Выборка = Справочники.Материалы.Выбрать(,,Новый Структура("Наименование",Наименование));
		Иначе
		Выборка = Справочники.Номенклатура.Выбрать(,,Новый Структура("Наименование",Наименование));
		КонецЕсли;
флВыбран = Ложь;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа Тогда
		Продолжить;
		КонецЕсли;                            
	Статус = ПолучитьСтатус(Выборка.Ссылка);
	ТЧ_ТН = ТЧ.ТаблицаНоменклатуры.Добавить();
	ТЧ_ТН.Номенклатура = Выборка.Ссылка;
	ТЧ_ТН.Статус = Статус;	
		Если Параметры.ТипСправочника = 1 Тогда
			Если Статус = Перечисления.СтатусыМПЗ.Запрещённая Тогда
			Продолжить;
			КонецЕсли;
		Иначе
			Если Статус = Перечисления.СтатусыСпецификаций.Запрещённая Тогда
			Продолжить;
			КонецЕсли;
		КонецЕсли; 
			Если Проект.Пустая() Тогда
				Если Параметры.ТипСправочника = 1 Тогда
					Если Статус = Перечисления.СтатусыМПЗ.ОНР Тогда
					Продолжить;
					КонецЕсли;
				Иначе
					Если (Статус <> Перечисления.СтатусыСпецификаций.Предсерийная)и
						 (Статус <> Перечисления.СтатусыСпецификаций.Серийная) Тогда
					Продолжить;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
	ТЧ.Номенклатура = Выборка.Ссылка;
	ТЧ.Статус = Статус;
	флВыбран = Истина;
	КонецЦикла; 
		Если Не флВыбран Тогда
			Если ТЧ.ТаблицаНоменклатуры.Количество() = 0 Тогда
			ТЧ.Комментарий = "не найдена";
			Иначе
			ТЧ.Комментарий = "не выбрана из имеющихся";						
			КонецЕсли;		
		КонецЕсли;
КонецПроцедуры
             
&НаКлиенте
Функция ПроверитьФайл(Результат,КоличествоМесяцев)
	Попытка
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	НомСтр = 0;
	    Для к = 2 по КолСтрок Цикл
		НомСтр = к; 
		Состояние("Обработка...",к*100/КолСтрок,"Проверка файла...");
			Для л = 2 По КоличествоМесяцев + 1 Цикл
			Кол = Число(ExcelЛист.Cells(к,л).Value);
			КонецЦикла;
		КонецЦикла;
	Исключение
	Сообщить("Ошибка в строке "+НомСтр);
	Сообщить(ОписаниеОшибки());
	Возврат(Ложь);	
	КонецПопытки;
Возврат(Истина);
КонецФункции 

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	ТаблицаПП.Очистить();
	Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c перспективным планом");
		Если Результат <> Неопределено Тогда
		Состояние("Обработка...",,"Проверка файла...");
			Если Не ПроверитьФайл(Результат,КоличествоМесяцев) Тогда
			Возврат;
			КонецЕсли;
		ExcelЛист = Результат.ExcelЛист;
		КолСтрок = Результат.КоличествоСтрок;
		КолКолонок = Результат.КоличествоКолонок;
		КоличествоМесяцев = КолКолонок - 1;
		    Для к = 2 по КолСтрок Цикл 
			Состояние("Обработка...",к*100/КолСтрок,"Создание списка номенклатуры из файла...");
			СписокМесяцев = Новый СписокЗначений;

				Для л = 2 По КоличествоМесяцев + 1 Цикл
				СписокМесяцев.Добавить(Число(ExcelЛист.Cells(к,л).Value));
				КонецЦикла; 
			ЗагрузитьИзФайлаНаСервере(СокрЛП(ExcelЛист.Cells(к,1).Value),СписокМесяцев);
		    КонецЦикла;
		Результат.Excel.Quit();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
